[{
  "id": 1,
  "image": "https://pinchofyum.com/wp-content/uploads/Cashew-Coffee-1-3-400x400.jpg",
  "title": "Unbelievably Good Cashew Coffee",
  "description": "Just two chocolate chip cookies - lightly crisp around the edge, and dense and buttery through the middle. They are thick enough to sink your teeth into and just really, really good.",
  "ingredients":[ "1 serving of strongly brewed coffee (about 1 1/2 cups)" ,
                  "1/4 cup cashews (roasted and unsalted is my favorite)" ,
                  "1 tablespoon honey (more or less to taste)" ,
                  "a small pinch of coarse sea salt" ],
  "instructions":[ "Blend all ingredients for about 45 seconds in a high-powered blender. Start on a lower speed and gradually work your way up, ending with about 15 seconds on a very high speed to ensure smooth and creamy texture. " ,
                   "Pour into a mug and enjoy, or chill for later (see notes)!" ],
  "notes":["Notes about cold vs. hot cashew coffee: Cashews straight out the package should blend just fine with hot coffee (although if you’re particular, just give them an overnight soak). If you want to a COLD cashew coffee, you have two options." ,
            "Option 1) Blend everything while the coffee is hot and then chill it overnight in a jar with a lid. It will separate, so just give it a good shake in the morning and pour over ice and you’ll be good to go. " ,
            "Option 2) Soak your cashews in water for a few hours and give them a good rinse. Now they should blend up nicely with cold coffee – either cold press or just chilled brewed coffee.",
            "I used very coarse flaked sea salt in this coffee, so just a word to the wise that it might not be best to put 1/2 teaspoon of regular table salt in the coffee! That will be way too salty. If using table salt, just start with a tiny pinch and taste and adjust from there."]
},
{
  "id": 2,
  "image": "https://pinchofyum.com/wp-content/uploads/Honey-Oatmilk-Latte-1-2-400x400.jpg",
  "title": "Oatmilk Honey Latte",
  "description": "Oatmilk Honey Latte – a delicious homemade morning treat! Steaming hot, rich, and dark coffee that’s satisfyingly creamy, barely sweet, and warm-spiced.",
  "ingredients":[ "3/4 cup oatmilk" ,
                  "1-2 tablespoons honey (depends how sweet you like it)" ,
                  "tiny tiny pinch of salt" ,
                  "1/2 cup of strongly brewed coffee (decaf, in my case!)",
                  "dusting of cinnamon, optional" ],
  "instructions":[ "Pour the oatmillk, honey, and salt into a glass jar. Microwave for about a minute, until very hot." ,
                   "Put a cap on the jar and wrap with a towel (the metal lid will get hot). Shake until foamy and delicious." ,
                   "Pour your milky mixture into a mug. Add coffee. Sprinkle with cinnamon. Your cozy morning awaits." ]
},
{
    "id":3,
    "image":"https://www.howsweeteats.com/wp-content/uploads/2021/03/lemon-parm-cauliflower-gnocchi-8.jpg",
    "title":"Cauliflower Orange Gnocchi",
    "description":"An at-home version of the Bar La Grassa favorite: Cauliflower Orange Gnocchi! Pillowy gnocchi, glossy sauce, paper-thin cauliflower. IT’S SO GOOD.",
    "ingredients":[ "1 package gnocchi (I use DeLallo)" ,
                    "2–3 tablespoons unsalted butter",
                    "a medium-large head of cauliflower, cored and thinly sliced into bite-sized pieces on a mandoline (about 3 cups)",
                    "2 shallots, minced (about 1/3 cup)",
                    "1/4 – 1/2 cup heavy cream (see notes)",
                    "1/2 – 1 teaspoons red pepper flakes",
                    "1 1/2 teaspoons salt (more to taste)",
                    "juice and zest of 1 orange (about 2 tablespoons of juice, zest to taste)",
                    "chives for topping" ],
    "instructions":[ "Cook the gnocchi according to package directions. Set aside.",
                     "Heat the butter over high heat in a large nonstick skillet. Add cauliflower, shallot, and cooked gnocchi; let it sit for a few minutes and then stir and repeat. You want the cauliflower and gnocchi to get browned, and the shallots to get soft.",
                     "Add in the cream, orange juice, red pepper flakes, and salt. Simmer for just a minute or two until desired consistency is reached – everything should be coated in a silky light sauce.",
                     "Serve immediately topped with fresh chives and orange zest. OH MY GOODNESS." ],
    "notes": [ "Most nonstick pan manufacturers will recommend not using high heat because it can wear down the pan faster and potentially cause the pan to give off toxic fumes (especially an empty pan), so just use the highest level of heat you are comfortable with. I usually use a high-ish heat – like 8/10 – with my Caraway brand nonstick pans. The higher heat is necessary for getting that pretty browning on the gnocchi and cauliflower!",
               "Using 1/4 cup heavy cream will give you a light, barely-there coating. It’s delicious. Using 1/2 cup of heavy cream will give you something more substantial, rich, and 'saucy.' Also delicious. You pick!" ]
},
{
    "id":4,
    "image":"https://www.feastingathome.com/wp-content/uploads/2017/08/Thai-Noodle-Salad-with-Peanut-Sauce-100-7.jpg",
    "title":"Peanut Noodle Salad",
    "description":"Peanut Noodle Salad – veggies, chicken, brown rice noodles, and an easy homemade dressing. My favorite salad ever!",
    "ingredients":[ "4 ounces brown rice noodles (affiliate link)",
                    "1 lb. boneless skinless chicken breasts",
                    "5–6 cups baby kale or spinach",
                    "3 large carrots, cut into small, thin pieces",
                    "3 bell peppers, cut into small, thin pieces",
                    "1 cup packed cilantro leaves, chopped",
                    "4 green onions, green parts only, chopped",
                    "1/2 cup cashews or peanuts" ],
    "instructions":[ "PREP: Start soaking the rice noodles in a bowl of cold water. Preheat the oven to 400 degrees.",
                     "DRESSING: Pulse all the dressing ingredients in a food processor EXCEPT peanut butter. Place the chicken in a plastic bag and use about 1/4 to 1/2 cup of the dressing (without peanut butter) to marinate the chicken in the fridge for about 15-30 minutes. Add the peanut butter to the dressing in the food processor; pulse, then taste and adjust. Set aside.",
                     "VEGGIES: Prep all your veggies and toss together in a bowl",
                     "Add in the cream, orange juice, red pepper flakes, and salt. Simmer for just a minute or two until desired consistency is reached – everything should be coated in a silky light sauce.",
                     "NOODLES: Drain the noodles (they should be softened at this point). Finish cooking them in a skillet over medium high heat. Add a little oil and a little dressing and toss them around until they are soft and pliable (if you need to add a little water to soften them, that works, too).",
                     "ASSEMBLY: Toss stir-fried noodles with the chicken and veggie mixture. Serve hot or cold. Top with extra peanuts and cilantro (and dressing, and lime juice, and sesame seeds, and…)" ],
    "notes":["*You can cut the carrots and peppers however you like, really. But I like to cut them so they sort of match the shape and texture of the noodles. A spiralizer, peeler, or mandoline are my favorite tools for this. The bowls used in this post are from Target!"]
},
{
    "id":5,
    "image":"https://pinchofyum.com/cdn-cgi/image/width=680,height=99999,fit=scale-down/wp-content/uploads/Agua-Fresca-1.jpg",
    "title":"Cucumber Agua Fresca",
    "description":"Cucumber Agua Fresca! Cucumber, lime, mint, lemongrass, sugar, and honey. The perfect tart + fresh summery drink!",
    "ingredients":[ "3 small cucumbers, cut into chunks",
                    "10 fresh basil leaves (or mint!)",
                    "2 whole limes, unpeeled and cut into quarters",
                    "1 tablespoon lemongrass paste or fresh lemongrass (can also use ginger)",
                    "1/2 cup sugar",
                    "1/4 cup honey",
                    "2 cups water + an additional 2 cups water later",
                    "ice for serving" ],
    "instructions":[ "Blend the cucumbers, basil, limes, lemongrass, sugar, honey, and 2 cups water together until smooth-ish.",
                     "Using a fine mesh strainer to catch all the pulp, pour the agua fresca into a pitcher. Discard pulp.",
                     "Mix an additional 2 cups water into the pitcher. Store in the fridge and serve over ice! SO GOOD." ],
    "notes":[ "For two people, we usually drink half of our batches that evening, and then keep the rest in the fridge and finish it the next night! Use best judgment in terms of food safety with your extras, as unpasteurized juices (especially ones that are not served fresh) can be unsafe for certain people.",
              "Potentially unpopular opinion? But I like to leave the WHOLE lime in the juice because the rind and pith of the lime gives a bitterness to the finished agua fresca that I think is so, so delicious. (Reminds me of this pie.) Also, since I don’t add alcohol to mine, this helps it feel slightly more like a cocktail. 🙂 If you’re not a fan of any bitter flavor, just use lime juice instead of whole limes." ]
},
{
    "id":6,
    "image":"https://pinchofyum.com/cdn-cgi/image/width=680,height=99999,fit=scale-down/wp-content/uploads/Chocolate-Cookies-2.jpg",
    "title":"The Very Best Chocolate Cookies",
    "description":"These are really the very best Chocolate Cookies! Thick, soft-centered, and crispy-edged. All your basic cookie ingredients here plus dark cocoa powder and ground cardamom to make things extra festive!",
    "ingredients":[ "2 cups unsalted butter, room temperature",
                    "3 1/2 cups brown sugar, loosely packed",
                    "2 large eggs",
                    "2 teaspoons vanilla extract",
                    "3 1/4 cups all-purpose flour (470 grams)",
                    "1 cup dark cocoa powder (100 grams)",
                    "1–2 tablespoons espresso powder (optional, but recommended if you’re using regular cocoa powder to give the flavor more depth)",
                    "1 1/2 teaspoon baking soda",
                    "1 teaspoon salt",
                    "extra cane or granulated sugar for rolling",
                    "1 teaspoon ground cardamom (optional)" ],
    "instructions":[ "Preheat oven to 350. In the bowl of a stand mixer, cream butter and sugar until fluffy and light. Add eggs and vanilla, mixing gently until just combined.",
                     "Add flour, cocoa powder, espresso powder, baking soda, and salt. Mix until combined into a soft dough.",
                     "Form into balls (about ¼ cup per cookie / ball). Roll each ball in the extra sugar (mixed with cardamom, if you want). Bake for 10-12 minutes (I recommend 6-8 at a time on the baking sheet, so you’ll need to bake in batches). Remove from oven and let them rest – you want the cookies settle down a bit and give you crisped edges with thicker, soft-baked centers." ],
    "notes":[ "These cookies are delicate and they can break easily, so be sure to let them cool fully before handling them too much. I’d recommend storing them in the fridge so they stay a bit stronger for transporting around to all your various Christmas events. 🙂 ",
              "If you find the dough is very sticky, or if you aren’t getting the slightly puffed centers like you see in the photos, try adding a tablespoon more flour to the remaining dough." ]
}]